app/controllers/comentarios_controller.rb

  def create
  #  Estamos obteniedo el articulo Xid
   @articulo = Articulo.find(params[:articulo_id])
   #Estamos creando el comentario dentro de articulo
   @comentario = @articulo.comentarios.create(comentario_params)
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comentarios" ("nombre", "cuerpo", "articulo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "prueba"], ["cuerpo", "asadsdsfdsfdf"], ["articulo_id", 1], ["created_at", "2018-06-29 01:09:08.146854"], ["updated_at", "2018-06-29 01:09:08.146854"]]