app/controllers/usuarios_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])